---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecifiedError
source: html/b64d75ee-16c0-b221-e688-cece7caf2c69.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BeamDirectionNotSpecifiedError Property

Beam direction not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId BeamDirectionNotSpecifiedError { get; }
```